tutorials/compressible/rhoPisoFoam/ras/IAPWS97_Pipe/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 5;

boundaryField
{
    WALL_1
    {
        type            compressible::kqRWallFunction;
        value           uniform 5;
    }
    WALL_2
    {
        type            compressible::kqRWallFunction;
        value           uniform 5;
    }
    INLET
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.01;
        value           uniform 5;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
